topics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-14 Fri 13:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Topics</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../globalStyle.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Topics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#linear-eqs">Linear Equations</a></li>
<li><a href="#gauss">Gaussian Elimination</a></li>
<li><a href="#vec-eqs">Vector Equations</a></li>
<li><a href="#mat-vec-eqs">Matrix-Vector Equations</a></li>
<li><a href="#linear-ind">Linear Independence</a></li>
<li><a href="#numerics">Numerics and NumPy (Part I)</a></li>
<li><a href="#linear-trans">Linear Transformations</a></li>
<li><a href="#mat-linear-trans">Matrices of Linear Transformations</a></li>
<li><a href="#matrix-alg">Matrix Algebra</a></li>
<li><a href="#numerics-ii">Numerics and NumPy (Part II)</a></li>
<li><a href="#matrix-inv">Matrix Inverse</a></li>
<li><a href="#inv-mat-thm">Invertible Matrix Theorem</a></li>
<li><a href="#algebraic-graph-theory">Algebraic Graph Theory</a></li>
<li><a href="#markov-chains">Markov Chains</a></li>
<li><a href="#matrix-fact">Matrix Factorization</a></li>
<li><a href="#graphics">Computer Graphics</a></li>
<li><a href="#subspaces">Subspaces</a></li>
<li><a href="#dim-rank">Dimension and Rank</a></li>
<li><a href="#eigenvectors">Eigenvalues and Eigenvectors</a></li>
<li><a href="#char-eq">The Characteristic Equation</a></li>
<li><a href="#diagonalization">Diagonalization</a></li>
<li><a href="#ortho">Orthogonality</a></li>
<li><a href="#pagerank">PageRank</a></li>
<li><a href="#ortho-proj">Orthogonal Projection</a></li>
<li><a href="#least-sqs">Least Squares</a></li>
<li><a href="#linear-models">Linear Models</a></li>
</ul>
</div>
</div>
<p>
This page is a list of topics
</p>
<div id="outline-container-linear-eqs" class="outline-2">
<h2 id="linear-eqs">Linear Equations</h2>
<div class="outline-text-2" id="text-linear-eqs">
</div>
</div>
<div id="outline-container-gauss" class="outline-2">
<h2 id="gauss">Gaussian Elimination</h2>
<div class="outline-text-2" id="text-gauss">
</div>
</div>
<div id="outline-container-vec-eqs" class="outline-2">
<h2 id="vec-eqs">Vector Equations</h2>
<div class="outline-text-2" id="text-vec-eqs">
</div>
</div>
<div id="outline-container-mat-vec-eqs" class="outline-2">
<h2 id="mat-vec-eqs">Matrix-Vector Equations</h2>
<div class="outline-text-2" id="text-mat-vec-eqs">
</div>
</div>
<div id="outline-container-linear-ind" class="outline-2">
<h2 id="linear-ind">Linear Independence</h2>
<div class="outline-text-2" id="text-linear-ind">
</div>
</div>
<div id="outline-container-numerics" class="outline-2">
<h2 id="numerics">Numerics and NumPy (Part I)</h2>
<div class="outline-text-2" id="text-numerics">
</div>
</div>
<div id="outline-container-linear-trans" class="outline-2">
<h2 id="linear-trans">Linear Transformations</h2>
<div class="outline-text-2" id="text-linear-trans">
</div>
</div>
<div id="outline-container-mat-linear-trans" class="outline-2">
<h2 id="mat-linear-trans">Matrices of Linear Transformations</h2>
<div class="outline-text-2" id="text-mat-linear-trans">
</div>
</div>
<div id="outline-container-matrix-alg" class="outline-2">
<h2 id="matrix-alg">Matrix Algebra</h2>
<div class="outline-text-2" id="text-matrix-alg">
</div>
</div>
<div id="outline-container-numerics-ii" class="outline-2">
<h2 id="numerics-ii">Numerics and NumPy (Part II)</h2>
<div class="outline-text-2" id="text-numerics-ii">
</div>
</div>
<div id="outline-container-matrix-inv" class="outline-2">
<h2 id="matrix-inv">Matrix Inverse</h2>
<div class="outline-text-2" id="text-matrix-inv">
</div>
</div>
<div id="outline-container-inv-mat-thm" class="outline-2">
<h2 id="inv-mat-thm">Invertible Matrix Theorem</h2>
<div class="outline-text-2" id="text-inv-mat-thm">
</div>
</div>
<div id="outline-container-algebraic-graph-theory" class="outline-2">
<h2 id="algebraic-graph-theory">Algebraic Graph Theory</h2>
<div class="outline-text-2" id="text-algebraic-graph-theory">
</div>
</div>
<div id="outline-container-markov-chains" class="outline-2">
<h2 id="markov-chains">Markov Chains</h2>
<div class="outline-text-2" id="text-markov-chains">
</div>
</div>
<div id="outline-container-matrix-fact" class="outline-2">
<h2 id="matrix-fact">Matrix Factorization</h2>
<div class="outline-text-2" id="text-matrix-fact">
</div>
</div>
<div id="outline-container-graphics" class="outline-2">
<h2 id="graphics">Computer Graphics</h2>
<div class="outline-text-2" id="text-graphics">
</div>
</div>
<div id="outline-container-subspaces" class="outline-2">
<h2 id="subspaces">Subspaces</h2>
<div class="outline-text-2" id="text-subspaces">
</div>
</div>
<div id="outline-container-dim-rank" class="outline-2">
<h2 id="dim-rank">Dimension and Rank</h2>
<div class="outline-text-2" id="text-dim-rank">
</div>
</div>
<div id="outline-container-eigenvectors" class="outline-2">
<h2 id="eigenvectors">Eigenvalues and Eigenvectors</h2>
<div class="outline-text-2" id="text-eigenvectors">
</div>
</div>
<div id="outline-container-char-eq" class="outline-2">
<h2 id="char-eq">The Characteristic Equation</h2>
<div class="outline-text-2" id="text-char-eq">
</div>
</div>
<div id="outline-container-diagonalization" class="outline-2">
<h2 id="diagonalization">Diagonalization</h2>
<div class="outline-text-2" id="text-diagonalization">
</div>
</div>
<div id="outline-container-ortho" class="outline-2">
<h2 id="ortho">Orthogonality</h2>
<div class="outline-text-2" id="text-ortho">
</div>
</div>
<div id="outline-container-pagerank" class="outline-2">
<h2 id="pagerank">PageRank</h2>
<div class="outline-text-2" id="text-pagerank">
</div>
</div>
<div id="outline-container-ortho-proj" class="outline-2">
<h2 id="ortho-proj">Orthogonal Projection</h2>
<div class="outline-text-2" id="text-ortho-proj">
</div>
</div>
<div id="outline-container-least-sqs" class="outline-2">
<h2 id="least-sqs">Least Squares</h2>
<div class="outline-text-2" id="text-least-sqs">
</div>
</div>
<div id="outline-container-linear-models" class="outline-2">
<h2 id="linear-models">Linear Models</h2>
<div class="outline-text-2" id="text-linear-models">
</div>
</div>
</div>
</body>
</html>
